#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//设计一个程序查看电脑是大端存储还是小端存储

//int object_check(void)
//{
//	int i = 1;
//	return *((char*)&i);
//}
//
//int main()
//{
//	int ret = 0;
//	ret = object_check();
//	if (1 == ret)
//	{
//		printf("小端存储\n");
//	}
//	else
//	{
//		printf("大端存储\n");
//
//	}
//	return 0;
//}

//小端存储：低位数据存在内存的低地址，高位数据存在内存的高地址

//大端存储：低位数据存在内存的高地址，高位数据存在内存的低地址
//int main()
//{
//	int a = 0x12345678;//在内存中由低到高为：87 56 34 12
//	return 0;
//}

//二级指针和数组的访问

//int main()
//{
//	int arr[4][2] = { {1,2},{3,4},{5,6},{7,8} };
//	int(*pa)[2] = arr;
//	printf("pa=%p   pa+1=%p\n", pa, pa + 1);//跳过两个int，
//	printf("pa=%p   *(pa)+1=%p\n", pa, *(pa) + 1);//跳过一个
//	printf("pa=%p   pa[0]+1=%p\n", pa, pa[0]+1);
//	printf("*pa=%p   *pa[1]=%d\n", *pa, *pa[1]);//*pa[n],方括号的优先级更高，先跳入一级指针，再进行解引用
//	printf("*((*pa)+1)=%d\n", *((*pa) + 1));
//	return 0;
//}

//--------------------------------------------------------------------------------
// //------------------------------------总结-------------------------------
							//arr[m][n]  <==>  *((*p+m)+n)


//函数形参接受 二维数组传参
//定义int arr[n][m]意为：arr是一个内含n个数组的二维数组（每个元素有m个int类型）

//函数接受二维数组时，可以省略行号，不能省略列号
//若不传递列数，编译器无法处理arr+1

//int main()
//{
//	int i = 0;
//	int arr[4] = { 1,2,3,4 };
//	int* p = arr;
//	for (i = 0; i < 4; i++, p++)
//	{
//		printf("%d  %d\n", arr[i], *p);
//	}
//	return 0;
//}